# 15) groupby 활용하여 다양한 데이터 집계를 활용하기

In [1]:
# 같은 category의 데이터를 모아서 따로 연산을 할 수 있다.

In [3]:
import pandas as pd
import seaborn as sns

In [4]:
df = sns.load_dataset("mpg")
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [5]:
df.groupby(by="origin") #아무것도 안나온다, size같은 function을 써야한다.

In [6]:
df.groupby(by="origin").size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [7]:
df["origin"].value_counts() #똑같은 결과긴 하다. 하지만 min, max, 이런것은 groupby 볼 수 있다.

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [8]:
df.groupby(by="origin").mean()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,27.891429,4.157143,109.142857,80.558824,2423.300000,16.787143,75.814286
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038
usa,20.083534,6.248996,245.901606,119.048980,3361.931727,15.033735,75.610442

In [9]:
df.groupby(by="origin").max()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,44.3,6,183.0,133.0,3820,24.8,82,vw rabbit custom
japan,46.6,6,168.0,132.0,2930,21.0,82,toyouta corona mark ii (sw)
usa,39.0,8,455.0,230.0,5140,22.2,82,pontiac ventura sj

In [10]:
df.groupby(by="origin")['cylinders'].mean()

origin
europe    4.157143
japan     4.101266
usa       6.248996
Name: cylinders, dtype: float64

In [12]:
df.groupby?

In [14]:
pd.DataFrame(df.groupby(['model_year', 'origin'])['cylinders'].mean())

                   cylinders
model_year origin
70         europe   4.000000
           japan    4.000000
           usa      7.636364
71         europe   4.000000
           japan    4.000000
           usa      6.200000
72         europe   4.000000
           japan    3.800000
           usa      6.888889
73         europe   4.000000
           japan    4.250000
           usa      7.241379
74         europe   4.000000
           japan    4.000000
           usa      6.266667
75         europe   4.000000
           japan    4.000000
           usa      6.400000
76         europe   4.250000
           japan    4.500000
           usa      6.363636
77         europe   4.000000
           japan    4.166667
           usa      6.222222
78         europe   4.833333
           japan    4.000000
           usa      6.000000
79         europe   4.250000
           japan    4.000000
           usa      6.260870
80         europe   4.111111
           japan    4.076923
           usa      4.285714
81         europe   4.500000
           japan    4.333333
           usa      4.923077
82         europe   4.000000
           japan    4.000000
           usa      4.300000

In [15]:
df2 = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12]],
index=[1, 2, 3],
columns=['a', 'b', 'c'])
df2

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [16]:
df2.shift(1) #row가 하나씩 밑으로 shift가 된다.

     a    b     c
1  NaN  NaN   NaN
2  4.0  7.0  10.0
3  5.0  8.0  11.0

In [17]:
df2.shift(-1) #row가 하나씩 위로 shift가 된다.

     a    b     c
1  5.0  8.0  11.0
2  6.0  9.0  12.0
3  NaN  NaN   NaN

In [18]:
df2['b'].shift(-1) #특정 column만도 가능

1    8.0
2    9.0
3    NaN
Name: b, dtype: float64

In [20]:
df2['b'].shift(2) #결측치 처리할 때 매우 유용하다.

1    NaN
2    NaN
3    7.0
Name: b, dtype: float64

In [23]:
df['model_year'].rank(method='min') #model_year의 값이 몇번째인지 보여주는것

0        1.0
1        1.0
2        1.0
3        1.0
4        1.0
5        1.0
6        1.0
7        1.0
8        1.0
9        1.0
10       1.0
11       1.0
12       1.0
13       1.0
14       1.0
15       1.0
16       1.0
17       1.0
18       1.0
19       1.0
20       1.0
21       1.0
22       1.0
23       1.0
24       1.0
25       1.0
26       1.0
27       1.0
28       1.0
29      30.0
       ...
368    368.0
369    368.0
370    368.0
371    368.0
372    368.0
373    368.0
374    368.0
375    368.0
376    368.0
377    368.0
378    368.0
379    368.0
380    368.0
381    368.0
382    368.0
383    368.0
384    368.0
385    368.0
386    368.0
387    368.0
388    368.0
389    368.0
390    368.0
391    368.0
392    368.0
393    368.0
394    368.0
395    368.0
396    368.0
397    368.0
Name: model_year, Length: 398, dtype: float64

In [24]:
df['model_year'].rank(method='min').value_counts()

86.0     40
245.0    36
183.0    34
368.0    31
153.0    30
339.0    29
281.0    29
310.0    29
1.0      29
217.0    28
58.0     28
30.0     28
126.0    27
Name: model_year, dtype: int64

In [25]:
df['model_year'].rank(method='max').value_counts()

125.0    40
280.0    36
216.0    34
398.0    31
182.0    30
367.0    29
309.0    29
338.0    29
29.0     29
244.0    28
85.0     28
57.0     28
152.0    27
Name: model_year, dtype: int64

In [26]:
df['model_year'].rank(method='dense') #밀집도로 몇번째 값이다.

0       1.0
1       1.0
2       1.0
3       1.0
4       1.0
5       1.0
6       1.0
7       1.0
8       1.0
9       1.0
10      1.0
11      1.0
12      1.0
13      1.0
14      1.0
15      1.0
16      1.0
17      1.0
18      1.0
19      1.0
20      1.0
21      1.0
22      1.0
23      1.0
24      1.0
25      1.0
26      1.0
27      1.0
28      1.0
29      2.0
       ...
368    13.0
369    13.0
370    13.0
371    13.0
372    13.0
373    13.0
374    13.0
375    13.0
376    13.0
377    13.0
378    13.0
379    13.0
380    13.0
381    13.0
382    13.0
383    13.0
384    13.0
385    13.0
386    13.0
387    13.0
388    13.0
389    13.0
390    13.0
391    13.0
392    13.0
393    13.0
394    13.0
395    13.0
396    13.0
397    13.0
Name: model_year, Length: 398, dtype: float64

In [27]:
df['model_year'].rank(pct=True).head() #percent를 의미하며, 비율이 어느정도인지 알 수 있다.

0    0.037688
1    0.037688
2    0.037688
3    0.037688
4    0.037688
Name: model_year, dtype: float64

In [29]:
df['model_year'].rank(method='first').head() #첫번째 값이 1위, 두번째 값이 2위

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: model_year, dtype: float64

In [30]:
df['model_year'].rank(method='first') #last는 없다.

0        1.0
1        2.0
2        3.0
3        4.0
4        5.0
5        6.0
6        7.0
7        8.0
8        9.0
9       10.0
10      11.0
11      12.0
12      13.0
13      14.0
14      15.0
15      16.0
16      17.0
17      18.0
18      19.0
19      20.0
20      21.0
21      22.0
22      23.0
23      24.0
24      25.0
25      26.0
26      27.0
27      28.0
28      29.0
29      30.0
       ...
368    369.0
369    370.0
370    371.0
371    372.0
372    373.0
373    374.0
374    375.0
375    376.0
376    377.0
377    378.0
378    379.0
379    380.0
380    381.0
381    382.0
382    383.0
383    384.0
384    385.0
385    386.0
386    387.0
387    388.0
388    389.0
389    390.0
390    391.0
391    392.0
392    393.0
393    394.0
394    395.0
395    396.0
396    397.0
397    398.0
Name: model_year, Length: 398, dtype: float64

In [31]:
df2.cumsum() #누적 합

    a   b   c
1   4   7  10
2   9  15  21
3  15  24  33

In [32]:
df2.cummax() #앞에 df2 [5,11,8]일 경우 5 11 11 나온다.

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [35]:
df2.cummin()

   a  b   c
1  4  7  10
2  4  7  10
3  4  7  10

In [36]:
df2.cumprod() #누적 곱

     a    b     c
1    4    7    10
2   20   56   110
3  120  504  1320